//TODO: № 1 на if...else ===============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.

// let a = 15;

// if (a === 10) {
//     console.log('Вірно');
// } else {
//     console.log("Невірно");
// }

// a === 10 ? console.log("Вірно") : console.log("Невірно");

// У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).

const min = 65;

if (min >= 0 && min <= 15) {
    console.log("Перша чверть");

}
else if (min >= 16 && min <= 30) {
    console.log("Друга чверть");
}
else if (min >= 31 && min <= 45) {
    console.log("Третя чверть");
}
else if (min >= 46 && min < 60) {
    console.log("Четверта чверть")
}

else {
    console.log("Такого значення не існує");
}